In [1]:
import pandas as pd
import numpy as np

In [8]:
student_perfomance = pd.read_csv('/Users/cram/Downloads/StudentsPerformance.csv')

In [9]:
student_perfomance.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [10]:
student_perfomance.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [12]:
student_perfomance

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [13]:
student_perfomance.groupby('gender').aggregate({'writing score': 'mean'})

        writing score
gender
female      72.467181
male        63.311203

In [14]:
student_perfomance.size

8000

In [16]:
student_perfomance.iloc[0:5, 0:3]

   gender race/ethnicity parental level of education
0  female        group B           bachelor's degree
1  female        group C                some college
2  female        group B             master's degree
3    male        group A          associate's degree
4    male        group C                some college

In [17]:
student_perfomance.iloc[[0, 3 , 10], [0, 1, -1]]

    gender race/ethnicity  writing score
0   female        group B             74
3     male        group A             44
10    male        group C             52

In [20]:
student_perfomance_with_names = student_perfomance.iloc[[0, 3, 4, 7, 8]]

In [21]:
student_perfomance_with_names

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67

In [22]:
student_perfomance_with_names.index = ['Eva', 'Vanya', 'Casha', 'Mark', 'Grisha']

In [24]:
student_perfomance_with_names

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
Eva,female,group B,bachelor's degree,standard,none,72,72,74
Vanya,male,group A,associate's degree,free/reduced,none,47,57,44
Casha,male,group C,some college,standard,none,76,78,75
Mark,male,group B,some college,free/reduced,none,40,43,39
Grisha,male,group D,high school,free/reduced,completed,64,64,67

In [30]:
student_perfomance_with_names.loc[['Eva', 'Vanya'], [ 'gender' ,'writing score']]

       gender  writing score
Eva    female             74
Vanya    male             44

In [31]:
student_perfomance_with_names.iloc[:, 0]

Eva       female
Vanya       male
Casha       male
Mark        male
Grisha      male
Name: gender, dtype: object

In [33]:
type(student_perfomance_with_names.iloc[:, 0])

pandas.core.series.Series

In [38]:
series1 = pd.Series([1, 2, 3], index=['Eva', 'Vanya', 'Casha'])
series2 = pd.Series([4, 6, 8], index=['Eva', 'Vanya', 'Casha'])

In [39]:
pd.DataFrame({'col_1': series1, 'col_2':series2})

       col_1  col_2
Eva        1      4
Vanya      2      6
Casha      3      8

In [40]:
student_perfomance_with_names['gender']

Eva       female
Vanya       male
Casha       male
Mark        male
Grisha      male
Name: gender, dtype: object

In [41]:
student_perfomance_with_names[['gender']]

        gender
Eva     female
Vanya     male
Casha     male
Mark      male
Grisha    male

In [44]:
student_perfomance.size

8000

In [45]:
student_perfomance.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [47]:
student_perfomance.shape

(1000, 8)

In [69]:
student_perfomance.dtypes.value_counts(8)

object    0.625
int64     0.375
dtype: float64

In [72]:
student_perfomance.dtypes.value_counts(8)

object    0.625
int64     0.375
dtype: float64

In [78]:
df = pd.read_csv('/Users/cram/Downloads/titanic.csv')

In [79]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [82]:
df.shape

(891, 12)